{
  "exhibitor_zk_hosts": "[string]: Comma separated list of IP address of the zookeeper machines ot use to back the DCOS-Internal Exhibitor. This is only used for exhibitor to co-ordinate it's config. All DCOS services work on the exhibitor cluster. It going down won't cause an outage, but must be resolved before you add a new master",
  "master_discovery": "String: One of {static, vrrp, cloud_dynamic}. Static refers to a static list of master IP addresses, must be stable. VRRP is master discovery via keepalived with a VIP, end-user is required to maintain this VIP infrastructure. Cloud_dynamic assumes an external proxy for the masters; haproxy, nginx, etc, that lives at a static IP.",
  "exhibitor_storage_backend": "String: One of {zookeeper, shared_filesystem, aws_s3}. The exhibitor storage backend is the storage facility used by Exhibitor.",
  "bootstrap_id": "String: The ID is auto generated for you from the latest build of DCOS. You can enter it here manually if desired to ensure the same build of DCOS is installed across more than one cluster.",
  "bootstrap_url":"String: This is the URL where the installer will get the bootstrap configuration files on other nodes in your infrastructure.",
  "channel_name": "String: The build channel for DCOS. Default is testing/continuous.",
  "cluster_name": "String: The unique name of this cluster.",
  "docker_remove_delay": "String: The time to retain the docker image generated by this installer.",
  "exhibitor_zk_path":"String: The path to find exhibitor.",
  "gc_delay": "String: The garbage collection delay.",
  "ip_detect_filename":"String: The filename of the ip-detect script.",
  "master_list":"[JSON ist of strings]: The list of strings containing your static master IPs. Must be in JSON list format ex: [\"10.0.0.1\"]",
  "resolvers": "[string]: The list of DNS resolvers for your DCOS host nodes.",
  "roles": "[string]: The Mesos role to delegate to this host machine.",
  "weights":"slave_public=int: I have no idea"

}
