{
  "exhibitor_zk_hosts": "Specify a comma-separated list of one or more Zookeeper node IP addresses to use for running the internal Exhibitor instance. Exhibitor uses these Zookeeper nodes to coordinate it's configuration. It is recommended that you specify an odd-number of IP addresses for optimal Exhibitor leader election.",
  "master_discovery": "Specify your Mesos master discovery method: static, vrrp, or cloud_dynamic. Static: a static list of stable master IP addresses. VRRP: use keepalived with a VIP. You are required to maintain this VIP infrastructure. Cloud_dynamic: use an external proxy for the masters, e.g. haproxy or nginx, that lives at a static IP.",
  "exhibitor_storage_backend": "Specify your Exhibitor storage facility method: static, zookeeper, shared_filesystem, or aws_s3.",
  "bootstrap_id": "Press Enter to accept the auto-generated default build ID or specify the build ID. The default build ID is auto-generated from the latest build of DCOS. You can enter the build ID manually to install the same build of DCOS across more than one cluster.",
  "bootstrap_url":"Specify the URL for the DCOS installer bootstrap configuration files. For example, 'http://bootstrap.dcos.example.com/dcos'.",
  "channel_name": "Specify the build channel name for DCOS or press Enter to accept the default value of testing/continuous.",
  "cluster_name": "Specify the unique name of this cluster.",
  "docker_remove_delay": "Specify the amount of time to save the Docker image generated by this installer or press Enter to accept the default of 1 hour.",
  "exhibitor_zk_path":"Specify the filepath to Exhibitor running on the Mesos masters.",
  "gc_delay": "Specify the garbage collection delay or press Enter to accept the default value of 2 days.",
  "ip_detect_filename":"Specify the filename of your IP detect script.",
  "master_list":"Specify a JSON-formatted list of your static master IP addresses. This must be specified in JSON list format, for example: [\"10.0.0.1\",\"10.0.0.2\"]",
  "resolvers": "Specify a JSON-formatted list of DNS resolvers for your DCOS host nodes or press Enter to accept the default value of [\"8.8.8.8\"]. Set this parameter to the most authoritative nameservers that you have. If you want to resolve internal hostnames, set it to a nameserver that can resolve them. If you have no internal hostnames to resolve, it is acceptable to set this to a public nameserver like Google or AWS.",
  "roles": "Specify the Mesos roles to delegate to this node ('master', 'slave', 'slave_public', or 'master_slave'), or press Enter to accept the default 'slave_public'. 'master' runs the master node. 'slave' runs the private agent node. 'slave_public' runs the public agent node. 'master_slave' runs the master and agent nodes. For more information, see https://open.mesosphere.com/reference/mesos-master/#roles.",
  "weights":"[role=weight,role=weight]: By default, resources in a cluster are shared on a first come first serve basis. However, you can define priorities for given roles (that are then applied to frameworks) that can reserve resources, effectively setting a higher priority for resources for a given role. A comma separated list of role/weight pairs of the form 'role=weight,role=weight'. Weights are used to indicate forms of priority.",
  "keepalived_router_id": "The unique virtual router ID of the keepalived cluster. This must be the same across your cluster.",
  "keepalived_interface": "The interface for that keepalived will work off.",
  "keepalived_pass": "If you've set your auth to PASS, this is the password you set in your configuration file.",
  "keepalived_virtual_ipaddress": "The VIP in use by your keepalived cluster.",
  "num_masters": "The number of masters in your DCOS cluster."
}
